[
  "What says “Pieces of nine, Pieces of nine”?\n\nANSWER: A Parroty Error",
  "Why do computer scientists get confused between Halloween and Christmas?\n\nANSWER: Because Oct 31 = Dec 25",
  "Why is the number 237 magical?\n\nANSWER: Because it is Hex ED",
  "How do robots eat pizza?\n\nANSWER: One byte at a time.",
  "What kind of steganography do pigs use to send secret messages?\n\nANSWER: Invisible oink.",
  "Why don’t avatars trust binary?\n\nANSWER: It makes up everything in the virtual world.",
  "How do dolphins compute?\n\nANSWER: They use a Central Porpoising Unit.",
  "There are many ways to get number representation wrong\n\nI. Not allocating enough space for the range of numbers you will be representing.\n\nII. Not allowing for the possibility of negative numbers\n\nIII. Choosing a representation that makes the operations you need to do difficult (like multiplying with Roman numerals)\n\nIIII. Forgetting how Roman numerals actually work.\n\n5. Forgetting what number representation you are using.\n\nForgetting whether you were counting from 0 or not and running off the end.",
  "I had a joke about variables but sadly I can’t remember it.",
  "I do have a joke about control structures. While I remember it, wait – just be patient. If you promise to keep it secret then I tell it. You laugh. You become happy. I become happy. Else we all become sad.",
  "I have a CS joke but it doesn’t compute.",
  "I have a joke about my work as a software engineer, but it only works for me.",
  "I have a joke about recursion, but I have a joke about recursion, but I have a joke about recursion, but I have a joke about recursion, but I have a joke about recursion, but I have a joke about recursion, but I have a joke about recursion, but I …",
  "What is a Roman forum?\n\nANSWER: II-um plus II-um",
  "How did the Vikings send messages?\n\nANSWER: By Norse code.",
  "What jungle animal has only two states – jumping out and scaring people or not.\n\nANSWER: A Boo-lion",
  "Who is the Patron Saint of copying people into emails?\n\nANSWER: St Francis of a CC.",
  "What business drives all its customers away but still makes a profit?\n\nANSWER: A self-driving taxi company.",
  "A programmer, a software engineer and a theoretical computer scientist were driving to Swansea. Soon after crossing the Severn bridge in to Wales they saw a black sheep alone in a field. The programmer commented “That’s intriguing, Welsh sheep are black”. The software engineer sighed and said “No, some Welsh sheep are black, and we need to test more”. The theoretical computer scientist looked up from her book, and said “There exists in Wales at least one field in which there is at least one sheep which has at least one black side”.",
  "What’s the most iconic pudding for chocolate loving computer scientists?\n\nANSWER: A GUI chocolate brownie",
  "What are digital native’s favourite puddings?\n\nANSWER: Crumble and Raspberry Pi",
  "What did the John Lennon say to Paul McCartney when Paul complained about his bright Christmas tree?\n\nANSWER: L.E.D it be",
  "How did the lobstr make sure its virtual Christmas cards arrived ok?\n\nANSWER: By sending them with an Error-Correcting Cod.",
  "Imagine you are in a locked room with 100 killer robots wearing Santa costumes. How do you get out?\n\nANSWER: Just stop imagining!",
  "What’s black and white and red all over?\n\nANSWER: Liquid crystal pixels on a monochrome e-reader.",
  "There are 10 types of people: those who understand binary, and those who don’t.",
  "Watched by a computer scientist, a biologist and a mathematician, a man and woman enter a house. A little later they see three people come out. The two scientists are each puzzled for a while but then the biologist, suddenly looks really happy and, exclaims “They must have reproduced”. The Computer Scientist, also looking pleased with herself, says “Ahh! there was a bug in the original counting algorithm – an initialization error”.  The mathematician, however, has been unperturbed by the whole thing and just remarks “If another person goes into the house, then the house will be empty.”",
  "Two bits walked into an expensive bar, but were thrown out because they didn’t have enough for a byte.",
  "There are 10 types of people: those who understand binary, those who don’t and those who count from 0.",
  "An SQL query goes into a bar, walks up to two tables and asks, “Can I join you?”",
  "There are 10 types of people: those who understand binary, those who don’t and those who didn’t expect this joke to be in ternary.",
  "Why is a quantum processor like messy hair?\n\nANSWER: Because both are a little entangled.",
  "What do you get if you cross a computer with an elephant?\n\nANSWER: Lots of memory",
  "Why do neurons in the brain enjoy texting?\n\nANSWER: Because they like to send and receive lots of messages.",
  "Why did the robot cross the road?\n\nANSWER: Because the chicken programmed it to.",
  "Which came first the chicken or the robot?\n\nANSWER: The chicken. Otherwise, who else would program the robot to cross the road?",
  "Which part of a bagpipe can do aerial surveillance?\n\nANSWER: The drone. \n\n(A drone is the name of one of the pipes on a bagpipe).",
  "What did the overheating supercomputer say to the mainframe?\n\nANSWER: I’ve had a megaflop!!",
  "The Raspberry PI said to the Beagle Bone, “HATs are cooler than capes”! The Beagle Bone replied, “But superheroes wear Capes!!” Then an Italian voice said, “I’ve been using shields way before any of you!!!”",
  "5 Volts fall on the ground… bang!",
  "Even numbers are NOT odd, they are just different.",
  "What did the computer worry about most at Halloween?\n\nANSWER: A byte from a vampire.",
  "What does the R in Recursion stand for?\n\nANSWER: Recursion.",
  "How easy is it to count in binary?\n\nANSWER: Its as easy as 01 10 11.",
  "Russell to Whitehead “My Gödel is killing me”.",
  "When cybernetics pioneer Norbert Weiner moved house his wife worried about how absent minded he was, so gave him a note giving directions to his new house when he went to work. Unfortunately by the end of the day he not only couldn’t remember their new address, he couldn’t remember where he put the note. Ever resourceful though he instead just went to his old neighbourhood where he approached a girl in the street and asked “Little girl could you tell me where the Weiner family who lived there moved to?” The girl replied “Yes daddy, Mummy said you’d be here and sent me to wait for you to take you home”.",
  "How did the first program die?\n\nANSWER: It was executed.",
  "How did the second program die?\n\nANSWER: From a bug.",
  "What do trees do on a computer?\n\nANSWER: They just log on and then log off.",
  "What do trees do on computers?\n\nANSWER: They branch out.",
  "Why shouldn’t doctors prescribe antibiotics to cure sick computers?\n\nANSWER: Because antibiotics have no effect on viruses.",
  "How do you cut up a program listing?\n\nANSWER: With a C-saw.",
  "What robot business drives all its customers away but still makes a profit?\n\nANSWER: A self-driving taxi company.",
  "What personal quality does a warehouse robot most need?\n\nANSWER: Shelf control.",
  "Why don’t elephants use desktop computers?\n\nANSWER: They are scared of the mouse.",
  "How does a computer scientist organise their bath toys?\n\nANSWER: Bubblesort",
  "How do cleaners put their mops in to order?\n\nANSWER: They Bucket sort them.",
  "How do botanists order their plant samples?\n\nANSWER: Using a tree sort",
  "How many computer scientists does it take to change a lightbulb?\n\nANSWER:None, they can see fine by the light of their laptop.",
  "How many help desk personnel does it take to change a lightbulb?\n\nANSWER: None, we have the same model of lightbulb as you and ours is working fine. Ticket closed.",
  "How many help desk people does it take to change a light bulb?\n\nANSWER: The lightbulb doesn’t need changing. It works fine here in the systems office when I try it. Ticket closed.",
  "How many help desk people does it take to change a light bulb?\n\nANSWER: Have you tried switching it off and then back on again?",
  "How many software engineers does it take to change a light bulb?\n\nANSWER: It can’t be done. It’s a hardware problem.",
  "How many OOP programmers does it take to change a lightbulb?\n\nANSWER: Stop thinking procedurally. The lightbulb should have inherited a change method from the generic light class, so you should be able to do it yourself with a simple change message.",
  "How many Test team people does it take to change a lightbulb?\n\nANSWER: None. Look we pointed out the room was dark. It’s not our job to find the solution, never mind make the changes.",
  "How many software developers does it take to change a lightbulb?\n\nANSWER: None. Couldn’t see how to do it, so we just changed the spec to require darkness.",
  "How many programmers do you need to change a lightbulb?\n\nANSWER: None. Why bother? The light from the screen is enough to keep programming.",
  "How many software engineers do you need to change a lightbulb?\n\nANSWER: Lots. You need one to write the requirements, one to make the change, one to develop use cases, one tester for each use case, someone to update the documentation and then someone to stress test it to destruction to ensure you know the new lightbulb’s modes of failure. At which point you will need to change the lightbulb again…",
  "How many electronic engineers does it take to change a light bulb?\n\nANSWER: None. Look, how many times do I have to tell you we are not electricians, never mind janitors, we are professional engineers.",
  "Two bits walk into a Tier 3 bar but they are thrown out because they don’t have enough for a substantial meal – in fact they don’t even have enough for a single byte or for that matter a nibble."
]